app/views/cheer_ups/index.html.erb

  <tr>
    <td><%= cheer_up.user.firstname %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1