app/controllers/cheer_ups_controller.rb

  def index
    @cheer_ups = CheerUp.all
---
SELECT "cheer_ups".* FROM "cheer_ups"

  def show
    @cheer_up = CheerUp.find(params[:id])
---
SELECT "cheer_ups".* FROM "cheer_ups" WHERE "cheer_ups"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    params[:cheer_up][:user_id] = current_user.id
    @cheer_up = CheerUp.new(params[:cheer_up])
    respond_to do |format|
      if @cheer_up.save
---
INSERT INTO "cheer_ups" ("content", "created_at", "image_upload", "latitude", "longitude", "rating", "sound_upload", "updated_at", "user_id", "votes") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"