app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "users" SET "email" = 'je@gmail.com', "firstname" = 'james', "lastname" = 'elliott', "image_upload" = '999670_10100117110930922_53605368_n.jpg', "bio" = 'I like to be happy', "updated_at" = '2013-08-02 13:11:01.216578' WHERE "users"."id" = 1